bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
        for (uint8_t i = 0; i < HWZC_VERIFY_READS; i++) {
            /* Wait one ADC conversion period FIRST so the read sees a fresh
             * sample (not the comparator-trigger sample). 80 NOPs ≈ 800 ns
             * + read/branch ≈ 1 µs total at SCCP3 = 1 MHz. */
            for (uint8_t j = 0; j < 80; j++) __asm__ volatile("nop");

#if GARUDA_TARGET_AK512
            uint16_t adc_now = HAL_ADC_BemfChannelData(v_core);
#else
            uint16_t adc_now = (v_core == 1) ? AD1CH5DATA : AD2CH1DATA;
#endif
            bool crossed = v_rising ? (adc_now > v_thresh) : (adc_now < v_thresh);
            if (!crossed) {
                /* Phantom — BEMF returned to original side within one sample
                 * period. Re-arm comparator, keep timeout running. */
                pData->hwzc.noiseRejectCount++;
                pData->hwzc.rejectsThisStep++;
                HAL_ADC_ClearComparatorFlag(v_core);
                HAL_ADC_EnableComparatorIE(v_core);
                return;
            }
        }
    }
#endif

#if FEATURE_HWZC_SECTOR_PI
    /* Sector PI mode: ZC has passed noise rejection. Just record the
     * timestamp and let the autonomous SCCP1 timer (set in OnBlankingExpired
     * to fire at lastCommStamp + timerPeriod) drive commutation.
     * HWZC_OnPiPeriodExpired will run the PI math using this capture.
     *
     * Comparator IE is disabled — this is the "one accept per sector" rule
     * (matches ATA's ProcessBemfSample one-shot semantic). Further ZC IRQs
     * in this sector would be phantoms or chatter; let them sleep until
     * the next OnBlankingExpired re-enables. */
    pData->hwzc.lastCaptureHR = zcStamp;
    pData->hwzc.captureValid  = true;

    /* INTERVAL ANCHOR measurement (2026-07-05, port of the Simplified tree's
     * 2026-07-01 cure): the ZC-to-ZC interval IS the rotor frequency — the
     * one quantity the phase-only PI never measured, which is why a 1.5-2x
     * alias was a stable fixed point (accepted captures gave zero phase
     * error while the true frequency went unmeasured). Divide multi-sector
     * gaps back by the sectors elapsed so silent/muted sectors don't bias
     * the estimate (the reactive path's single-step-only guard is exactly
     * what froze it at low speed in the 2026-07-05 A/B).
     * Guards: need a prior accept this enable (goodZcCount>0), a sane
     * sector count (1..6), and a per-step result within [floor, 4x current
     * estimate] — outside that the gap spans a resync/blind stretch and is
     * discarded (counter resets; next pair measures cleanly). */
    if (pData->hwzc.goodZcCount > 0
        && pData->hwzc.sectorsSinceCapture >= 1
        && pData->hwzc.sectorsSinceCapture <= 6)
    {
        uint32_t perStep = (zcStamp - pData->hwzc.lastZcStamp)
                           / pData->hwzc.sectorsSinceCapture;
        if (perStep >= RT_HWZC_MIN_STEP_TICKS
            && perStep <= (pData->hwzc.measuredPeriodHR << 2))
        {
            pData->hwzc.measuredPeriodHR =
                (3 * pData->hwzc.measuredPeriodHR + perStep) / 4;
        }
    }
    pData->hwzc.sectorsSinceCapture = 0;

    pData->hwzc.lastZcStamp   = zcStamp;   /* interval base + legacy diag */
    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

    /* PHASE RE-ANCHOR: slave the commutation grid to the rotor — restart
     * SCCP1 so the sector ends (30−adv)/60·T after THIS crossing instead
     * of at the autonomous lastComm+T deadline. Silent sectors still get
     * the autonomous fire (dead-reckon preserved); phase stays WATCHING so
     * the fire dispatches OnPiPeriodExpired as before. Delay was cached by
     * the last PI tick (one tick stale ≈ the reactive path's tolerance).
     *
     * PLAUSIBILITY-GATED (2026-07-05 second bench pass): a raw re-anchor
     * bypasses every clamp — at CL entry, post-blank phantom fires dragged
     * each commutation earlier in a self-reinforcing cascade to the 2x
     * lock (15.9k at 5% duty, every start). Re-time the grid ONLY when the
     * crossing sits where a real ZC can be: past 5/16 of the sector (post-
     * blank ripple lives below ~0.2T; real crossings at ~0.5T+adv, early
     * under accel ~0.4T) and inside the sector. Captures that fail the
     * gate still feed the interval measurement and the clamped PI trim —
     * exactly the part-1 behavior that idled clean. Also held off during
     * the CL-entry handoff-damp window. */
    {
        uint32_t Tcur = pData->hwzc.timerPeriod;
        uint32_t posInSector = zcStamp - pData->hwzc.lastCommStamp;
        if (
#if FEATURE_HWZC_HANDOFF_DAMP
            pData->hwzc.handoffDamp == 0 &&
#endif
            posInSector >= ((Tcur >> 2) + (Tcur >> 4))   /* >= 0.3125*T */
            && posInSector < Tcur)
        {
            uint32_t d = pData->hwzc.cachedCommDelay;
            if (d < 10) d = 10;
            HAL_SCCP1_StartOneShot(d);
        }
    }

    HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);
    return;
#endif

    /* Cancel the timeout timer */
    HAL_SCCP1_Stop();

    /* Update stepPeriodHR with seqlock (Rule 13).
     * Guard 1: only update IIR when this ZC follows exactly one commutation
     * (consecutive detection). Multi-step intervals include timeout periods,
     * not real motor periods — they contaminate the estimator.
     * Guard 2: freeze IIR for the first N ZCs after HWZC_Enable. A single
     * phantom or mistimed ZC during morph handoff used to pull stepPeriodHR
     * rapidly toward floor (observed in ~50% of morph attempts). Holding the
     * seeded stepPeriodHR for a few cycles lets the motor lock in at the
     * morph-exit rate before the IIR starts adapting. */
    if (pData->hwzc.stepsSinceLastHwZc == 1
        && pData->hwzc.goodZcCount >= HWZC_IIR_FREEZE_ZC_COUNT)
    {
        pData->hwzc.writeSeq++;  /* odd = write in progress */
        uint32_t newPeriod = (3 * pData->hwzc.stepPeriodHR + interval) / 4;
        if (newPeriod < RT_HWZC_MIN_STEP_TICKS)
            newPeriod = RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.stepPeriodHR = newPeriod;
        pData->hwzc.writeSeq++;  /* even = stable */
    }
    pData->hwzc.stepsSinceLastHwZc = 0;

    pData->hwzc.lastZcStamp = zcStamp;

    /* Track consecutive good ZCs (saturate to prevent stale re-seed) */
    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

