bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    /* Optimization B: use commDelay pre-computed by OnBlankingExpired.
     * Saves ~1.5 µs of division/interpolation inside the latency-critical ISR.
     * The cached value reflects stepPeriodHR at blanking-expiry, which is the
     * same IIR-filtered value used here except for the one IIR update above
     * (25% weight on the just-measured interval — negligible at steady state). */
    uint32_t commDelay = pData->hwzc.cachedCommDelay;
    if (commDelay < 10) commDelay = 10;

    /* Gate comparator OFF during COMM_PENDING. After accepting a real ZC, the
     * BEMF stays on the crossed side until the next commutation — any further
     * comparator IRQs in this window come from PWM ripple oscillating the
     * signal back across threshold, body-diode recovery, or cross-coupling,
     * and waste ~5µs of ISR time each (verify reads + interval check + re-arm)
     * for no useful purpose. At high RPM these spurious ISRs starve the 24kHz
     * ADC ISR, delaying threshold updates and degrading the NEXT sector's
     * detection. Re-enabled in OnBlankingExpired of next step. */
    HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_COMM_PENDING;

    HAL_SCCP1_StartOneShot(commDelay);
}

#if (FEATURE_HWZC_FALLING_SW || FEATURE_ZC_FRONTEND == ZC_FE_SOFTNEUTRAL) && FEATURE_HWZC_SECTOR_PI
/**
 * @brief Accept a ZC found by a software front end (falling-SW OFF-center
 *        detector, or the softneutral sample ISR — BOTH polarities).
 *
 * RESTORED 2026-07-05 (falling-SW hybrid, purged 9ec01c8). The caller
 * (garuda_service.c ADC ISR) has already done the falling-specific
 * screening: one-per-sector (!captureValid), plausibility floor
 * (> T/4 into the sector, past demag/DCM dips), speed cap, and the
 * threshold compare (filter-comped neutral − deadband). This function is
 * the accept bookkeeping — an exact mirror of HWZC_OnZcDetected's PI
 * accept branch (keep the two in lockstep):
 *   capture record, INTERVAL-ANCHOR measurement (divide-back over silent
 *   sectors), counters, and the plausibility-GATED phase re-anchor.
 * No comparator IE to disable here — with FALLING_SW the comparator is
 * armed rising-only, so falling sectors never fire it. No verify reads —
 * the SW sample IS a settled ADC conversion, not an edge event.
 */
void HWZC_OnFrontEndCapture(volatile GARUDA_DATA_T *pData, uint32_t zcStamp)
{
    pData->hwzc.lastCaptureHR = zcStamp;
    pData->hwzc.captureValid  = true;

    /* INTERVAL ANCHOR measurement — same guards as the rising path:
     * prior accept this enable, sane sector count, per-step within
     * [floor, 4x estimate]. See HWZC_OnZcDetected for the full story. */
    if (pData->hwzc.goodZcCount > 0
        && pData->hwzc.sectorsSinceCapture >= 1
        && pData->hwzc.sectorsSinceCapture <= 6)
    {
        uint32_t perStep = (zcStamp - pData->hwzc.lastZcStamp)
                           / pData->hwzc.sectorsSinceCapture;
        if (perStep >= RT_HWZC_MIN_STEP_TICKS
            && perStep <= (pData->hwzc.measuredPeriodHR << 2))
        {
            pData->hwzc.measuredPeriodHR =
                (3 * pData->hwzc.measuredPeriodHR + perStep) / 4;
        }
    }
    pData->hwzc.sectorsSinceCapture = 0;

    pData->hwzc.lastZcStamp   = zcStamp;
    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

    /* PHASE RE-ANCHOR, plausibility-gated — identical to the rising path.
     * The caller's T/4 floor overlaps but is looser than the 0.3125T gate;
     * both apply. */
    {
        uint32_t Tcur = pData->hwzc.timerPeriod;
        uint32_t posInSector = zcStamp - pData->hwzc.lastCommStamp;
        if (
#if FEATURE_HWZC_HANDOFF_DAMP
            pData->hwzc.handoffDamp == 0 &&
#endif
            posInSector >= ((Tcur >> 2) + (Tcur >> 4))   /* >= 0.3125*T */
            && posInSector < Tcur)
        {
            uint32_t d = pData->hwzc.cachedCommDelay;
            if (d < 10) d = 10;
            HAL_SCCP1_StartOneShot(d);
        }
    }
}
#endif /* (FALLING_SW || SOFTNEUTRAL) && FEATURE_HWZC_SECTOR_PI */

/**
 * @brief Commutation deadline reached — advance to next step.
 * Called from SCCP1 ISR when phase == HWZC_COMM_PENDING.
 */
void HWZC_OnCommDeadline(volatile GARUDA_DATA_T *pData)
{
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;  /* 16-bit, atomic for observer (Rule 13) */
    pData->hwzc.stepsSinceLastHwZc++;

    /* Set up ZC detection for the new step */
    HWZC_OnCommutation(pData);
}

#if FEATURE_HWZC_SECTOR_PI
/**
 * @brief Sector PI period expired — run PI math and commutate.
 *
 * Called from SCCP1 ISR (via _CCT1Interrupt) when phase == HWZC_WATCHING
 * AND FEATURE_HWZC_SECTOR_PI=1. In reactive mode this slot is HWZC_OnTimeout
 * (a missed-ZC handler); in PI mode it is the AUTONOMOUS commutation event.
 *
 * Algorithm (ported from PATA6847 sector_pi.c at the 225k milestone):
 *   1. Compute setValue from current advance schedule and timerPeriod.
 *      setValue = (advancePlus30Fp8 × timerPeriod) >> 8
 *      At lock, capValue ≈ setValue. With filter comp already aligning
 *      capValue with the true rotor ZC, the formula assumes:
 *          ZC happens at (advance + 30°)/60° of the inter-commutation
 *          interval, since commutation fires `advance°` early relative
 *          to the next rotor sector boundary.
 *   2. delta = capValue − setValue (signed phase error)
 *   3. delta = clamp(delta, ±timerPeriod >> CLAMP_SHIFT)
 *   4. integrator += delta >> KI_SHIFT
 *   5. timerPeriod = integrator + (delta >> KP_SHIFT)
 *   6. Advance commutation step, re-arm next sector.
 *
 * On capture-miss: skip PI update (timerPeriod unchanged), still commutate.
 * The motor is more robust to a missed sample than to a wrong correction.
 */

void HWZC_OnPiPeriodExpired(volatile GARUDA_DATA_T *pData)
{
    /* One PI tick = one commutation: count sectors for the interval
     * anchor's divide-back (reset on each accepted capture). Saturate
     * well above the 6-step validity cap so a long blind stretch stays
     * recognizable as invalid. */
    if (pData->hwzc.sectorsSinceCapture < 0xFF)
        pData->hwzc.sectorsSinceCapture++;

    /* Compute current torque-advance (interpolated from RT_TIMING_ADV_MAX_DEG)
     * — same schedule the reactive path uses, just consumed differently. */
    uint16_t advDeg;
    uint32_t T = pData->hwzc.timerPeriod;
#if FEATURE_TIMING_ADVANCE
    uint32_t eRPM = (T > 0) ? HWZC_TICKS_TO_ERPM(T) : 0;
    if (eRPM <= RT_RAMP_TARGET_ERPM)
        advDeg = TIMING_ADVANCE_MIN_DEG;
    else if (eRPM >= RT_TIMING_ADV_FULL_ERPM)
        advDeg = RT_TIMING_ADV_MAX_DEG;
    else {
        uint32_t range = RT_TIMING_ADV_FULL_ERPM - RT_RAMP_TARGET_ERPM;
        uint32_t pos = eRPM - RT_RAMP_TARGET_ERPM;
        advDeg = TIMING_ADVANCE_MIN_DEG +
            (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                       * pos / range);
    }
#else
    advDeg = 0;
#endif
    pData->hwzc.dbgAdvanceDeg = advDeg;

