bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    /* advancePlus30Fp8 = (30 + advDeg) × 256 / 60. Max value at advDeg=30 is 256;
     * at advDeg=0 is 128. Fits comfortably in uint16. */
    uint16_t advFp8 = (uint16_t)(((30u + (uint32_t)advDeg) * 256u) / 60u);

    /* PHASE RE-ANCHOR precompute (2026-07-05, second half of the interval-
     * anchor port): ZC-to-commutation delay = T − setValue = (30−adv)/60·T.
     * OnZcDetected restarts SCCP1 with this on every accepted capture, so
     * commutation phase is enforced GEOMETRICALLY from the rotor's own
     * crossing — the role the deleted free integrator used to play by
     * slowly absorbing phase error. Without this, the ±3% Kp trim is too
     * weak to hold alignment and the grid slips continuously against the
     * rotor (bench 2026-07-05: 22k at 24% duty, 5-6 A of torque-fighting).
     * Cached here (once per tick) to keep the capture ISR division-free —
     * same pattern as the reactive path's cachedCommDelay. */
    pData->hwzc.cachedCommDelay = T - (((uint32_t)advFp8 * T) >> 8);

#if FEATURE_ZC_FRONTEND == ZC_FE_SOFTNEUTRAL
    {   /* Speed-scaled vote (spec §4.2): filter latency collapses as sectors
         * shrink (BLHeli 20->1 / AM32 12->2 pattern). Period compare,
         * division-free; recomputed once per sector, consumed by the
         * 400 kHz sample ISR. */
        if      (T > (1000000000UL / ZC_FE_VOTE_ERPM_1)) pData->hwzc.feVoteN = ZC_FE_VOTE_SLOW;
        else if (T > (1000000000UL / ZC_FE_VOTE_ERPM_2)) pData->hwzc.feVoteN = ZC_FE_VOTE_MID;
        else                                             pData->hwzc.feVoteN = 1;
    }
    {   /* Known-latency compensation (spec §4.4): the divider RC lag and the
         * vote's detection lag are DETERMINISTIC TIMES — subtract them from
         * the re-anchor delay so commutation lands on the true rotor phase
         * at every speed (replaces the legacy threshold-side filter-comp).
         * HR/SCCP ticks are FCY ticks = 10 ns (eRPM = 1e9/periodTicks at
         * 100 MHz FCY); ZC_FE_TAU_NS is ns -> /10; ZC_FE_SAMPLE_TICKS is
         * already FCY ticks. Vote lag = (N-1) sample periods + half a
         * period mean detection delay. */
        uint32_t tauTicks = (uint32_t)ZC_FE_TAU_NS / 10u
                          + (uint32_t)(pData->hwzc.feVoteN - 1u) * ZC_FE_SAMPLE_TICKS
                          + ZC_FE_SAMPLE_TICKS / 2u;
        uint32_t d = pData->hwzc.cachedCommDelay;
        pData->hwzc.cachedCommDelay = (d > tauTicks + 10u) ? (d - tauTicks) : 10u;
    }
#endif

#if FEATURE_HWZC_PI_DEFENSIVE
    /* Track whether THIS event has a capture (BEFORE the gate below
     * consumes captureValid). Used by the defensive-mode streak counters
     * regardless of whether the capture passes the 0<cap<T range check.
     * A rejected capture (cap > T) is NOT silence — only "captureValid==
     * false at entry" counts toward the defensive trigger. */
    bool hadCaptureThisEvent = pData->hwzc.captureValid;
    if (!hadCaptureThisEvent)
        pData->hwzc.dbgPiNoCap++;        /* bring-up diag: silent PI event */
#endif

    /* Run PI if we have a fresh capture from this sector */
    if (pData->hwzc.captureValid) {
        /* capValue = elapsed HR ticks FROM THE START OF THIS SECTOR (i.e. the
         * most recent commutation = lastCommStamp) TO the captured ZC.
         *
         * Timing: OnPiPeriodExpired fires BEFORE OnCommutation runs. So at
         * this moment, lastCommStamp still holds T_N (start of the sector
         * that's ending), and lastCaptureHR ≈ T_N + T/2 (ZC at midpoint).
         * After PI math, OnCommutation shifts prevCommHR ← lastCommStamp
         * and lastCommStamp ← now. Modular subtraction handles SCCP2 wrap
         * (every ~42 s at 100 MHz). */
        uint32_t capValue = pData->hwzc.lastCaptureHR - pData->hwzc.lastCommStamp;
        uint32_t setValue = ((uint32_t)advFp8 * T) >> 8;

        /* bring-up diag: capture position in sector, even if rejected —
         * split by ZC polarity (even sectors 0/2/4 = rising comparator path,
         * odd 1/3/5 = falling RC-filtered SW path). */
        if (T > 0) {
            uint16_t pm = (uint16_t)(((uint64_t)capValue * 1000u) / T);
            if (pData->currentStep & 1)
                pData->hwzc.dbgPiCrossSector = pm;   /* falling-sector cap */
            else
                pData->hwzc.dbgLastCapPm = pm;       /* rising-sector cap */
        }

        /* Cross-sector reject (same gate in both float and int paths). */
        if (capValue > T) {
            pData->hwzc.dbgPiMissCount++;
            pData->hwzc.captureValid = false;
            goto pi_commutate;
        }

        int32_t delta = (int32_t)capValue - (int32_t)setValue;

        /* Per-capture delta clamp — ASYMMETRIC at high RPM. */
        int32_t posDeltaCap, negDeltaCap;
        if (T < HWZC_PI_CLAMP_HIGH_TICKS) {
            posDeltaCap = (int32_t)(T >> HWZC_PI_DELTA_CLAMP_SHIFT_HIGH);
            negDeltaCap = (int32_t)(T >> HWZC_PI_NEG_DELTA_CLAMP_SHIFT_HIGH);
        } else {
            posDeltaCap = (int32_t)(T >> HWZC_PI_DELTA_CLAMP_SHIFT);
            negDeltaCap = posDeltaCap;
        }
#if FEATURE_HWZC_HANDOFF_DAMP
        /* Hand-off damp: during the first window after CL entry, hard-limit how
         * much a single capture can SHRINK the period (negative delta only), so a
         * too-early first capture can't collapse to the half-period phantom. Legit
         * acceleration is gradual and proceeds at the damped rate; the runaway is
         * blocked. negative delta = capture earlier than setpoint = period shrink. */
        if (pData->hwzc.handoffDamp > 0) {
            pData->hwzc.handoffDamp--;
            int32_t damped = (int32_t)(T >> HWZC_HANDOFF_NEG_SHIFT);
            if (damped < 1) damped = 1;
            if (negDeltaCap > damped) negDeltaCap = damped;
        }
#endif
        if (delta >  posDeltaCap) delta =  posDeltaCap;
        if (delta < -negDeltaCap) delta = -negDeltaCap;
        pData->hwzc.dbgPiDelta = (int16_t)(delta > 32767 ? 32767
                                          : delta < -32768 ? -32768
                                          : delta);

#if FEATURE_HWZC_PI_FLOAT
        /* --- FLOAT PI (Phase 1) --- */
        float deltaF = (float)delta;
        (void)T;

  #if FEATURE_HWZC_PI_DEFENSIVE
        /* In defensive mode, ignore the capture's delta — captures during
         * a silence-recovery window can be misleading. The slow-down
         * logic below the if/else block walks T larger. */
        if (!pData->hwzc.piDefActive) {
  #endif
            /* INTERVAL ANCHOR (2026-07-05): pin the integrator to the
             * MEASURED frequency every tick instead of free-integrating
             * phase error. The old law (integratorF += Ki*delta) owned the
             * period through accumulated phase momentum — a 1.5-2x alias
             * satisfied it (near-zero deltas on the captures it kept) and
             * every clamp only bounded the drift, none re-anchored it. Now
             * the period IS the interval measurement, and the PI survives
             * only as a bounded phase trim: |Kp*delta| <= Kp*T/8 ~ 3% of T.
             * An alias cannot hold: each accepted true crossing re-measures
             * the frequency and pulls the grid back 25% per accept.
             * (Same law that cured the identical 192k-vs-150k wall in the
             * Simplified tree, control.c:452-511, bench-proven 2026-07-01.) */
            pData->hwzc.integratorF = (float)pData->hwzc.measuredPeriodHR;
            if (pData->hwzc.integratorF < (float)RT_HWZC_MIN_STEP_TICKS)
                pData->hwzc.integratorF = (float)RT_HWZC_MIN_STEP_TICKS;

            float newPerF = pData->hwzc.integratorF + HWZC_PI_KP_FLOAT * deltaF;
            if (newPerF < (float)RT_HWZC_MIN_STEP_TICKS)
                newPerF = (float)RT_HWZC_MIN_STEP_TICKS;

