bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
            pData->hwzc.timerPeriod = (uint32_t)newPerF;
            pData->hwzc.integrator  = (uint32_t)pData->hwzc.integratorF;
  #if FEATURE_HWZC_PI_DEFENSIVE
        }
  #endif
#else
        /* --- ORIGINAL INTEGER BIT-SHIFT PI --- */
        /* Integrator update — slow drift correction. */
        int32_t newInt = (int32_t)pData->hwzc.integrator + (delta >> HWZC_PI_KI_SHIFT);
        if (newInt < (int32_t)RT_HWZC_MIN_STEP_TICKS)
            newInt = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        if (newInt < 0) newInt = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.integrator = (uint32_t)newInt;

        /* Period update — fast dynamics. */
        int32_t newPer = (int32_t)pData->hwzc.integrator + (delta >> HWZC_PI_KP_SHIFT);
        if (newPer < (int32_t)RT_HWZC_MIN_STEP_TICKS)
            newPer = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        if (newPer < 0) newPer = (int32_t)RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.timerPeriod = (uint32_t)newPer;
#endif /* FEATURE_HWZC_PI_FLOAT */

#if FEATURE_HWZC_ABS_FLOOR
        /* Absolute operating-point floor — block the harmonic false-lock that
         * the relative gates can't (cumulative ratchet → phantom). The rotor
         * cannot spin faster than the no-load physics for the present duty/Vbus,
         * so the commanded period cannot be shorter than P_ff/(overspeed margin).
         * Reuses the FF-seed no-load-period formula (see HWZC_Enable). */
        {
            float dutyFrac = (float)pData->duty / (float)LOOPTIME_TCY;
            float vbus_v   = (float)pData->vbusRaw * VBUS_SCALE_V_PER_COUNT;
            float lambdaPm = (float)gspParams.focKeUvSRad;
            if (dutyFrac > HWZC_ABS_FLOOR_MIN_DUTYFRAC && vbus_v > 6.0f
                && lambdaPm > 0.0f) {
                float P_ff = (181.380f * lambdaPm) / (vbus_v * dutyFrac);
                /* Duty-tiered overspeed ceiling: tight at idle/low duty (no
                 * advance -> rotor can't exceed ~no-load, so a fast-chop phantom
                 * at ~140% is clamped to ~no-load and the loop coasts to true
                 * idle), loose at high duty where advance legitimately overspeeds. */
                float overPct = (dutyFrac < HWZC_ABS_FLOOR_LOW_DUTYFRAC)
                    ? (float)HWZC_ABS_FLOOR_OVERSPEED_PCT_LOW
                    : (float)HWZC_ABS_FLOOR_OVERSPEED_PCT;
                uint32_t floorP = (uint32_t)(P_ff * (100.0f / overPct));
                /* SHRINK-ONLY: clamp only when the PI is DRIVING the period
                 * below the floor (commutating FASTER — the phantom). A period
                 * already below the floor but GROWING (T_new > T_entry) is a
                 * legitimate high-speed decel coasting down through the floor —
                 * the rotor really is that fast — so let it track. The rotor
                 * cannot ACCELERATE at idle duty, so a shrink below floor is
                 * provably a false-lock. */
                if (pData->hwzc.timerPeriod < floorP
                    && pData->hwzc.timerPeriod < T) {
                    pData->hwzc.timerPeriod = floorP;
  #if FEATURE_HWZC_PI_FLOAT
                    if (pData->hwzc.integratorF < (float)floorP)
                        pData->hwzc.integratorF = (float)floorP;
  #endif
                    if (pData->hwzc.integrator < floorP)
                        pData->hwzc.integrator = floorP;
                    /* Lift the interval-anchor measurement too — a measured
                     * period below the no-load physics floor came from
                     * phantom-pair intervals; don't let the anchor re-inject
                     * it next tick. */
                    if (pData->hwzc.measuredPeriodHR < floorP)
                        pData->hwzc.measuredPeriodHR = floorP;
                }
            }
        }
#endif

        /* Mirror to stepPeriodHR so eRPM telemetry (and the reactive
         * path's diagnostics) reflect the PI-controlled rotor period. */
        pData->hwzc.writeSeq++;
        pData->hwzc.stepPeriodHR = pData->hwzc.timerPeriod;
        pData->hwzc.writeSeq++;

        pData->hwzc.captureValid = false;
        pData->hwzc.dbgPiCaptureCount++;
        {
            uint8_t s = pData->currentStep;
            if (s < 6) pData->hwzc.dbgPiCapBySector[s]++;
        }
        if (pData->hwzc.goodZcCount < 0xFFFE) /* keep goodZc growing for telem */
            pData->hwzc.goodZcCount++;
    } else {
        /* No capture this sector — period unchanged. Robust by design.
         * Track which sector is missing so we can confirm AD1 vs AD2 split. */
        pData->hwzc.dbgPiMissCount++;
        pData->hwzc.missCount++;
        pData->hwzc.totalMissCount++;
        {
            uint8_t s = pData->currentStep;
            if (s < 6) pData->hwzc.dbgPiMissBySector[s]++;
        }
    }

#if FEATURE_HWZC_PI_DEFENSIVE
    /* --- DEFENSIVE PI streak tracking + slow-down ---
     * Only true silence (no capture event at all) counts toward the
     * defensive trigger. A capture that arrived but was rejected by the
     * range gate (cap > T) is NOT silence — those are transient
     * mismatches the PI handles normally. */
    if (hadCaptureThisEvent) {
        pData->hwzc.piDefMissStreak = 0;
        if (pData->hwzc.piDefGoodStreak < 0xFFFF)
            pData->hwzc.piDefGoodStreak++;
    } else {
        if (pData->hwzc.piDefMissStreak < 0xFFFF)
            pData->hwzc.piDefMissStreak++;
        pData->hwzc.piDefGoodStreak = 0;
    }

    /* Enter / exit defensive mode (hysteresis: 6 in / 2 out) */
    if (!pData->hwzc.piDefActive &&
        pData->hwzc.piDefMissStreak >= HWZC_PI_DEFENSIVE_TRIGGER) {
        pData->hwzc.piDefActive = 1;
        if (pData->hwzc.piDefEntryCount < 0xFFFFFFFF)
            pData->hwzc.piDefEntryCount++;
    } else if (pData->hwzc.piDefActive &&
               pData->hwzc.piDefGoodStreak >= HWZC_PI_DEFENSIVE_EXIT) {
        pData->hwzc.piDefActive = 0;
    }

    /* While defensive, walk integratorF (and timerPeriod) larger to
     * deliberately slow the bridge so the rotor can catch up. */
    if (pData->hwzc.piDefActive) {
  #if FEATURE_HWZC_PI_FLOAT
        pData->hwzc.integratorF *= (1.0f + (float)HWZC_PI_DEFENSIVE_GROW_PCT * 0.01f);
        pData->hwzc.timerPeriod = (uint32_t)pData->hwzc.integratorF;
        pData->hwzc.integrator  = (uint32_t)pData->hwzc.integratorF;
  #else
        /* Integer-PI fallback: scale by (100 + grow) / 100 */
        uint32_t scaled = (pData->hwzc.integrator
                           * (100UL + HWZC_PI_DEFENSIVE_GROW_PCT)) / 100UL;
        pData->hwzc.integrator  = scaled;
        pData->hwzc.timerPeriod = scaled;
  #endif
        /* Mirror to stepPeriodHR so telemetry stays consistent */
        pData->hwzc.writeSeq++;
        pData->hwzc.stepPeriodHR = pData->hwzc.timerPeriod;
        pData->hwzc.writeSeq++;
    }
#endif /* FEATURE_HWZC_PI_DEFENSIVE */

pi_commutate:
    /* Slow-IIR update of stepPeriodForFilterComp — this is the period used
     * in ω·τ for HWZC_ApplyFilterComp. Decoupled from timerPeriod to break
     * the positive-feedback loop where a single PI period-shrink → larger
     * ω·τ → larger CMPLO offset → earlier comparator fire → more PI shrink.
     *
     * Shift 11 → 1/2048 per sector ≈ 11 ms time constant at 190k eRPM.
     * Slow vs PI per-sector dynamics (~1 ms) → loop gain << 1.
     * Fast vs real motor accel (~50 ms) → tracks real changes adequately. */
    if (pData->hwzc.stepPeriodForFilterComp == 0) {
        pData->hwzc.stepPeriodForFilterComp = pData->hwzc.timerPeriod;
    } else {
        int32_t pDelta = (int32_t)pData->hwzc.timerPeriod
                       - (int32_t)pData->hwzc.stepPeriodForFilterComp;
        pData->hwzc.stepPeriodForFilterComp =
            (uint32_t)((int32_t)pData->hwzc.stepPeriodForFilterComp
                       + (pDelta >> 11));
    }

    /* Advance to next sector — autonomous timer drives this regardless
     * of capture state. OnCommutation re-arms BLANKING + comparator. */
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;
    pData->hwzc.stepsSinceLastHwZc = 0;
    HWZC_OnCommutation(pData);

#if FEATURE_SPEED_PI
    /* Speed PI runs after the timing PI has updated stepPeriodHR.
     * Per-ZC interval-based: this fires every sector (variable rate
     * scaling with rotor speed). No-op until SPEED_PI_Enable() called
     * by CL state entry. */
    SPEED_PI_OnZcEvent(pData);
#endif
#if FEATURE_SPEED_CASCADE
    /* WS4: outer speed PI of the cascade — runs after the timing PI has
     * updated stepPeriodHR; produces the inner loop's current reference.
     * No-op until SPEED_CASCADE_Enable() on CL entry. */
    SPEED_CASCADE_OnZcEvent(pData);
#endif
}
#endif /* FEATURE_HWZC_SECTOR_PI */

/**
 * @brief ZC timeout — no crossing detected within 2x step period.
 * Called from SCCP1 ISR when phase == HWZC_WATCHING.
 * Either forces a step or falls back to software ZC on miss-limit.
 */
void HWZC_OnTimeout(volatile GARUDA_DATA_T *pData)
{
    /* Capture diagnostics: what did the ADC channel actually see? */
    uint8_t core = pData->hwzc.activeCore;
#if GARUDA_TARGET_AK512
    /* Per-phase channels: VA = AD1CH1, VB = AD1CH2, VC = AD2CH2 */
    if (core == FLOATING_PHASE_A)
    {
        pData->hwzc.dbgTimeoutAdcVal = AD1CH1DATA;
        pData->hwzc.dbgTimeoutThresh = AD1CH1CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD1CH1CON2bits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD1CMPSTATbits.CH1FLG;
    }
    else if (core == FLOATING_PHASE_B)
    {
        pData->hwzc.dbgTimeoutAdcVal = AD1CH2DATA;
        pData->hwzc.dbgTimeoutThresh = AD1CH2CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD1CH2CON2bits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD1CMPSTATbits.CH2FLG;
    }
    else
    {
        pData->hwzc.dbgTimeoutAdcVal = AD2CH2DATA;
        pData->hwzc.dbgTimeoutThresh = AD2CH2CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD2CH2CON2bits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD2CMPSTATbits.CH2FLG;
    }
#else
    if (core == 1)
    {
        pData->hwzc.dbgTimeoutAdcVal = AD1CH5DATA;
        pData->hwzc.dbgTimeoutThresh = AD1CH5CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD1CH5CONbits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD1CMPSTATbits.CH5CMP;
    }
    else
    {
        pData->hwzc.dbgTimeoutAdcVal = AD2CH1DATA;
        pData->hwzc.dbgTimeoutThresh = AD2CH1CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD2CH1CONbits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD2CMPSTATbits.CH1CMP;
    }
#endif /* GARUDA_TARGET_AK512 */
    pData->hwzc.dbgTimeoutCore = core;
    pData->hwzc.dbgTimeoutStep = pData->currentStep;
    pData->hwzc.dbgTimeoutBemfThresh = pData->bemf.zcThreshold;

